#include <MsTimer2.h>
#include "PinIO.h"
#include "LedBlink.h"

//-----------------------------------------------------------------
// 初期処理
//-----------------------------------------------------------------
void setup() {
  // put your setup code here, to run once:
  pinModeSetup();
  timerTaskSetup();
}

//-----------------------------------------------------------------
// メインループ
//-----------------------------------------------------------------
void loop() {
  // put your main code here, to run repeatedly:

}

//-----------------------------------------------------------------
// PinIO初期化関数
//-----------------------------------------------------------------
void pinModeSetup(void){
  pinMode( WORKING_LED , OUTPUT);
}

//-----------------------------------------------------------------
// 定周期タスク登録&開始
//-----------------------------------------------------------------
void timerTaskSetup(){
  MsTimer2::set(BLINK_TIMER,ledBlink);  // LED点滅
  MsTimer2::start();
}

