#include "arduino.h"

//-----------------------------------------------------------------
// タイムスタンプ　電源ONしてからの時間を出力(単位：ms)
//  millis()の制約上、約50日間でオーバーフローし、ゼロに戻ります。 
//-----------------------------------------------------------------
void timeStamp(){ 
   Serial.print("{"); 
   Serial.print(millis(),DEC);
   Serial.print("}");
}
//-----------------------------------------------------------------
// 改行
//-----------------------------------------------------------------
void ln(){
   Serial.print("\r\n"); 
}

